export default {
	legislature (val) {
		const values = {
			'upper' : 'အမျိုးသားလွှတ်တော်',
			'lower' : 'ပြည်သူ့လွှတ်တော်'
		}

		return values[val];
	},
	term (val) {
		const values = {
			2 : 'ဒုတိယအကြိမ်'
		}
		return values[val];
	},
	session (val) {
		const values = {
			1 : 'ပထမပုံမှန်အစည်းအဝေး',
			2 : 'ဒုတိယပုံမှန်အစည်းအဝေး',
			3 : 'တတိယပုံမှန်အစည်းအဝေး',
			4 : 'စတုတ္ထပုံမှန်အစည်းအဝေး',
			5 : 'ပဥ္စမပုံမှန်အစည်းအဝေး',
			6 : 'ဆဋ္ဌမပုံမှန်အစည်းအဝေး',
			7 : 'သတ္တမပုံမှန်အစည်းအဝေး',
			8 : 'အဋ္ဌမပုံမှန်အစည်းအဝေး',
			9 : 'နဝမပုံမှန်အစည်းအဝေး',
			10 : 'ဒသမပုံမှန်အစည်းအဝေး'
		}

		return values[val];
	}
}